src/Web/Dynamics.Crm.Web/Libs/SDK.MetaData.min.js

SDK=window.SDK||{__namespace:!0};SDK.Metadata=SDK.Metadata||{__namespace:!0},function(){function r(n){var l,r,u,f,e,t,o,s,c,v;if(n.status===12029)return new Error("The attempt to connect to the server failed.");if(n.status===12007)return new Error("The server name could not be resolved.");if(l=n.responseXML,r="Unknown (unable to parse the fault)",typeof l=="object"){var i=null,a=null,y=l.firstChild.firstChild;for(u=0;u<y.childNodes.length;u++)if(f=y.childNodes[u],"s:Fault"===f.nodeName){for(e=0;e<f.childNodes.length;e++)if(t=f.childNodes[e],"faultstring"===t.nodeName&&(i=h(t)),"detail"===t.nodeName)for(o=0;o<t.childNodes.length;o++)if(s=t.childNodes[o],"OrganizationServiceFault"===s.nodeName)for(c=0;c<s.childNodes.length;c++)if(v=s.childNodes[c],"ErrorCode"===v.nodeName){a=h(v);break}break}}return!a||!i?i&&(r=i):r="Error Code:"+a+" Message: "+i,new Error(r)}function l(){return typeof GetGlobalContext!="undefined"?GetGlobalContext():typeof Xrm!="undefined"?Xrm.Page.context:new Error("Context is not available.")}function u(){return l().getClientUrl()}function s(n){var t=[];return(1&n)==1&&t.push("Entity"),(2&n)==2&&t.push("Attributes"),(4&n)==4&&t.push("Privileges"),(8&n)==8&&t.push("Relationships"),t.join(" ")}function a(n){for(var t=0;t<o.length;t++)if(n===o[t])return!0;return!1}function t(n){var s,f,e,h,o,u,r;if(!!n.attributes&&n.attributes.length===1&&!!n.attributes.getNamedItem("i:nil")&&n.attributes.getNamedItem("i:nil").nodeValue==="true")return null;if(!!n.firstChild&&n.firstChild.nodeType===3){s=i(n);switch(s){case"ActivityTypeMask":case"ObjectTypeCode":case"ColumnNumber":case"DefaultFormValue":case"MaxValue":case"MinValue":case"MaxLength":case"Order":case"Precision":case"PrecisionSource":case"LanguageCode":return parseInt(n.firstChild.nodeValue,10);case"AutoRouteToOwnerQueue":case"CanBeChanged":case"CanTriggerWorkflow":case"IsActivity":case"IsAIRUpdated":case"IsActivityParty":case"IsAvailableOffline":case"IsChildEntity":case"IsCustomEntity":case"IsCustomOptionSet":case"IsDocumentManagementEnabled":case"IsEnabledForCharts":case"IsGlobal":case"IsImportable":case"IsIntersect":case"IsManaged":case"IsReadingPaneEnabled":case"IsValidForAdvancedFind":case"CanBeSecuredForCreate":case"CanBeSecuredForRead":case"CanBeSecuredForUpdate":case"IsCustomAttribute":case"IsPrimaryId":case"IsPrimaryName":case"IsSecured":case"IsValidForCreate":case"IsValidForRead":case"IsValidForUpdate":case"IsCustomRelationship":case"CanBeBasic":case"CanBeDeep":case"CanBeGlobal":case"CanBeLocal":return n.firstChild.nodeValue==="true"?!0:!1;case"Value":return n.firstChild.nodeValue==="true"||n.firstChild.nodeValue==="false"?n.firstChild.nodeValue==="true"?!0:!1:n.firstChild.nodeValue==="ApplicationRequired"||n.firstChild.nodeValue==="None"||n.firstChild.nodeValue==="Recommended"||n.firstChild.nodeValue==="SystemRequired"?n.firstChild.nodeValue:(f=parseInt(n.firstChild.nodeValue,10),isNaN(f)?n.firstChild.nodeValue:f);default:return n.firstChild.nodeValue}}if(a(i(n))){for(e=[],r=0;r<n.childNodes.length;r++)h=!n.childNodes[r].attributes||!n.childNodes[r].attributes.getNamedItem("i:type")?i(n.childNodes[r]):n.childNodes[r].attributes.getNamedItem("i:type").nodeValue.split(":")[1],o=t(n.childNodes[r]),o._type=h,e.push(o);return e}if(n.childNodes.length===0)return null;for(u={},n.attributes.getNamedItem("i:type")&&(u._type=n.attributes.getNamedItem("i:type").nodeValue.split(":")[1]),r=0;r<n.childNodes.length;r++)u[i(n.childNodes[r])]=n.childNodes[r].nodeType===3?n.childNodes[r].nodeValue:t(n.childNodes[r]);return u}function v(n,t){if(typeof n.selectNodes!="undefined")return n.selectNodes(t);for(var r=[],u=n.evaluate(t,n,c,XPathResult.ANY_TYPE,null),i=u.iterateNext();i;)r.push(i),i=u.iterateNext();return r}function f(n,t){if(typeof n.selectSingleNode!="undefined")return n.selectSingleNode(t);var r=new XPathEvaluator,i=r.evaluate(t,n,c,XPathResult.FIRST_ORDERED_NODE_TYPE,null);return i?i.singleNodeValue:null}function h(n){return typeof n.text!="undefined"?n.text:n.textContent}function i(n){return typeof n.baseName!="undefined"?n.baseName:n.localName}function e(n){n.setProperty("SelectionNamespaces","xmlns:s='http://schemas.xmlsoap.org/soap/envelope/' xmlns:a='http://schemas.microsoft.com/xrm/2011/Contracts' xmlns:i='http://www.w3.org/2001/XMLSchema-instance' xmlns:b='http://schemas.datacontract.org/2004/07/System.Collections.Generic' xmlns:c='http://schemas.microsoft.com/xrm/2011/Metadata'")}function c(n){return{s:"http://schemas.xmlsoap.org/soap/envelope/",a:"http://schemas.microsoft.com/xrm/2011/Contracts",i:"http://www.w3.org/2001/XMLSchema-instance",b:"http://schemas.datacontract.org/2004/07/System.Collections.Generic",c:"http://schemas.microsoft.com/xrm/2011/Metadata"}[n]||null}function n(n){var t,i="",r;if(n===null)return null;if(n==="")return"";for(r=0;r<n.length;r++)t=n.charCodeAt(r),i=t>96&&t<123||t>64&&t<91||t===32||t>47&&t<58||t===46||t===44||t===45||t===95?i+String.fromCharCode(t):i+"&#"+t+";";return i}this.RetrieveAllEntities=function(i,f,o,h,c){if(typeof i!="number"||i<1||i>15)throw new Error("SDK.Metadata.RetrieveAllEntities EntityFilters must be a SDK.Metadata.EntityFilters value.");if(typeof f!="boolean")throw new Error("SDK.Metadata.RetrieveAllEntities RetrieveAsIfPublished must be a boolean value.");if(typeof o!="function")throw new Error("SDK.Metadata.RetrieveAllEntities successCallBack must be a function.");if(typeof h!="function")throw new Error("SDK.Metadata.RetrieveAllEntities errorCallBack must be a function.");var a=s(i),y=['<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">','<soapenv:Header><a:SdkClientVersion xmlns:a="http://schemas.microsoft.com/xrm/2011/Contracts">7.0<\/a:SdkClientVersion><\/soapenv:Header>',"<soapenv:Body>",'<Execute xmlns="http://schemas.microsoft.com/xrm/2011/Contracts/Services" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">','<request i:type="a:RetrieveAllEntitiesRequest" xmlns:a="http://schemas.microsoft.com/xrm/2011/Contracts">','<a:Parameters xmlns:b="http://schemas.datacontract.org/2004/07/System.Collections.Generic">',"<a:KeyValuePairOfstringanyType>","<b:key>EntityFilters<\/b:key>",'<b:value i:type="c:EntityFilters" xmlns:c="http://schemas.microsoft.com/xrm/2011/Metadata">'+n(a)+"<\/b:value>","<\/a:KeyValuePairOfstringanyType>","<a:KeyValuePairOfstringanyType>","<b:key>RetrieveAsIfPublished<\/b:key>",'<b:value i:type="c:boolean" xmlns:c="http://www.w3.org/2001/XMLSchema">'+n(f.toString())+"<\/b:value>","<\/a:KeyValuePairOfstringanyType>","<\/a:Parameters>",'<a:RequestId i:nil="true" />',"<a:RequestName>RetrieveAllEntities<\/a:RequestName>","<\/request>","<\/Execute>","<\/soapenv:Body>","<\/soapenv:Envelope>"].join(""),l=new XMLHttpRequest;l.open("POST",u()+"/XRMServices/2011/Organization.svc/web",!0);try{l.responseType="msxml-document"}catch(p){console.error(p)}l.setRequestHeader("Accept","application/xml, text/xml, */*");l.setRequestHeader("Content-Type","text/xml; charset=utf-8");l.setRequestHeader("SOAPAction","http://schemas.microsoft.com/xrm/2011/Contracts/Services/IOrganizationService/Execute");l.onreadystatechange=function(){var i,u,f,n,s;if(l.readyState===4)if(l.onreadystatechange=null,l.status===200){i=l.responseXML;try{e(i)}catch(a){console.error(a)}for(u=v(i,"//c:EntityMetadata"),f=[],n=0;n<u.length;n++)s=t(u[n]),s._type="EntityMetadata",f.push(s);o(f,c)}else h(r(l))};l.send(y)};this.RetrieveEntity=function(i,o,h,c,l,a,v){var w,p,b,y;if(typeof i!="number"||i<1||i>15)throw new Error("SDK.Metadata.RetrieveEntity EntityFilters must be a SDK.Metadata.EntityFilters value.");if(o===null&&h===null)throw new Error("SDK.Metadata.RetrieveEntity requires either the LogicalName or MetadataId parameter not be null.");if(o!==null){if(typeof o!="string")throw new Error("SDK.Metadata.RetrieveEntity LogicalName must be a string value.");h="00000000-0000-0000-0000-000000000000"}if(h!==null&&o===null&&typeof h!="string")throw new Error("SDK.Metadata.RetrieveEntity MetadataId must be a string value.");if(typeof c!="boolean")throw new Error("SDK.Metadata.RetrieveEntity RetrieveAsIfPublished must be a boolean value.");if(typeof l!="function")throw new Error("SDK.Metadata.RetrieveEntity successCallBack must be a function.");if(typeof a!="function")throw new Error("SDK.Metadata.RetrieveEntity errorCallBack must be a function.");w=s(i);p="";p=o===null?'<b:value i:nil="true" />':'<b:value i:type="c:string"   xmlns:c="http://www.w3.org/2001/XMLSchema">'+n(o.toLowerCase())+"<\/b:value>";b=['<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">','<soapenv:Header><a:SdkClientVersion xmlns:a="http://schemas.microsoft.com/xrm/2011/Contracts">6.0<\/a:SdkClientVersion><\/soapenv:Header>',"<soapenv:Body>",'<Execute xmlns="http://schemas.microsoft.com/xrm/2011/Contracts/Services" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">','<request i:type="a:RetrieveEntityRequest" xmlns:a="http://schemas.microsoft.com/xrm/2011/Contracts">','<a:Parameters xmlns:b="http://schemas.datacontract.org/2004/07/System.Collections.Generic">',"<a:KeyValuePairOfstringanyType>","<b:key>EntityFilters<\/b:key>",'<b:value i:type="c:EntityFilters" xmlns:c="http://schemas.microsoft.com/xrm/2011/Metadata">'+n(w)+"<\/b:value>","<\/a:KeyValuePairOfstringanyType>","<a:KeyValuePairOfstringanyType>","<b:key>MetadataId<\/b:key>",'<b:value i:type="ser:guid"  xmlns:ser="http://schemas.microsoft.com/2003/10/Serialization/">'+n(h)+"<\/b:value>","<\/a:KeyValuePairOfstringanyType>","<a:KeyValuePairOfstringanyType>","<b:key>RetrieveAsIfPublished<\/b:key>",'<b:value i:type="c:boolean" xmlns:c="http://www.w3.org/2001/XMLSchema">'+n(c.toString())+"<\/b:value>","<\/a:KeyValuePairOfstringanyType>","<a:KeyValuePairOfstringanyType>","<b:key>LogicalName<\/b:key>",p,"<\/a:KeyValuePairOfstringanyType>","<\/a:Parameters>",'<a:RequestId i:nil="true" />',"<a:RequestName>RetrieveEntity<\/a:RequestName>","<\/request>","<\/Execute>","<\/soapenv:Body>","<\/soapenv:Envelope>"].join("");y=new XMLHttpRequest;y.open("POST",u()+"/XRMServices/2011/Organization.svc/web",!0);try{y.responseType="msxml-document"}catch(k){console.error(k)}y.setRequestHeader("Accept","application/xml, text/xml, */*");y.setRequestHeader("Content-Type","text/xml; charset=utf-8");y.setRequestHeader("SOAPAction","http://schemas.microsoft.com/xrm/2011/Contracts/Services/IOrganizationService/Execute");y.onreadystatechange=function(){var n,i;if(y.readyState===4)if(y.onreadystatechange=null,y.status===200){n=y.responseXML;try{e(n)}catch(u){console.error(u)}i=t(f(n,"//b:value"));i._type="EntityMetadata";l(i,v)}else a(r(y))};y.send(b)};this.RetrieveAttribute=function(i,o,s,h,c,l,a){var y,p,w,v;if(i===null&&o===null&&s===null)throw new Error("SDK.Metadata.RetrieveAttribute requires either the EntityLogicalName and LogicalName  parameters or the MetadataId parameter not be null.");if(s!==null&&i===null&&o===null){if(typeof s!="string")throw new Error("SDK.Metadata.RetrieveEntity MetadataId must be a string value.");}else s="00000000-0000-0000-0000-000000000000";if(i!==null&&typeof i!="string")throw new Error("SDK.Metadata.RetrieveAttribute EntityLogicalName must be a string value.");if(o!==null&&typeof o!="string")throw new Error("SDK.Metadata.RetrieveAttribute LogicalName must be a string value.");if(typeof h!="boolean")throw new Error("SDK.Metadata.RetrieveAttribute RetrieveAsIfPublished must be a boolean value.");if(typeof c!="function")throw new Error("SDK.Metadata.RetrieveAttribute successCallBack must be a function.");if(typeof l!="function")throw new Error("SDK.Metadata.RetrieveAttribute errorCallBack must be a function.");y=i===null?'<b:value i:nil="true" />':'<b:value i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">'+n(i.toLowerCase())+"<\/b:value>";p=o===null?'<b:value i:nil="true" />':'<b:value i:type="c:string"   xmlns:c="http://www.w3.org/2001/XMLSchema">'+n(o.toLowerCase())+"<\/b:value>";w=['<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">','<soapenv:Header><a:SdkClientVersion xmlns:a="http://schemas.microsoft.com/xrm/2011/Contracts">6.0<\/a:SdkClientVersion><\/soapenv:Header>',"<soapenv:Body>",'<Execute xmlns="http://schemas.microsoft.com/xrm/2011/Contracts/Services" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">','<request i:type="a:RetrieveAttributeRequest" xmlns:a="http://schemas.microsoft.com/xrm/2011/Contracts">','<a:Parameters xmlns:b="http://schemas.datacontract.org/2004/07/System.Collections.Generic">',"<a:KeyValuePairOfstringanyType>","<b:key>EntityLogicalName<\/b:key>",y,"<\/a:KeyValuePairOfstringanyType>","<a:KeyValuePairOfstringanyType>","<b:key>MetadataId<\/b:key>",'<b:value i:type="ser:guid"  xmlns:ser="http://schemas.microsoft.com/2003/10/Serialization/">'+n(s)+"<\/b:value>","<\/a:KeyValuePairOfstringanyType>","<a:KeyValuePairOfstringanyType>","<b:key>RetrieveAsIfPublished<\/b:key>",'<b:value i:type="c:boolean" xmlns:c="http://www.w3.org/2001/XMLSchema">'+n(h.toString())+"<\/b:value>","<\/a:KeyValuePairOfstringanyType>","<a:KeyValuePairOfstringanyType>","<b:key>LogicalName<\/b:key>",p,"<\/a:KeyValuePairOfstringanyType>","<\/a:Parameters>",'<a:RequestId i:nil="true" />',"<a:RequestName>RetrieveAttribute<\/a:RequestName>","<\/request>","<\/Execute>","<\/soapenv:Body>","<\/soapenv:Envelope>"].join("");v=new XMLHttpRequest;v.open("POST",u()+"/XRMServices/2011/Organization.svc/web",!0);try{v.responseType="msxml-document"}catch(b){console.error(b)}v.setRequestHeader("Accept","application/xml, text/xml, */*");v.setRequestHeader("Content-Type","text/xml; charset=utf-8");v.setRequestHeader("SOAPAction","http://schemas.microsoft.com/xrm/2011/Contracts/Services/IOrganizationService/Execute");v.onreadystatechange=function(){var n,i;if(v.readyState===4)if(v.onreadystatechange=null,v.status===200){n=v.responseXML;try{e(n)}catch(u){console.error(u)}i=t(f(n,"//b:value"));c(i,a)}else l(r(v))};v.send(w)};this.EntityFilters=function(){throw new Error("Constructor not implemented this is a static enum.");};var o=["Attributes","ManyToManyRelationships","ManyToOneRelationships","OneToManyRelationships","Privileges","LocalizedLabels","Options","Targets"]}.call(SDK.Metadata);SDK.Metadata.EntityFilters.prototype={Default:1,Entity:1,Attributes:2,Privileges:4,Relationships:8,All:15};SDK.Metadata.EntityFilters.Default=1;SDK.Metadata.EntityFilters.Entity=1;SDK.Metadata.EntityFilters.Attributes=2;SDK.Metadata.EntityFilters.Privileges=4;SDK.Metadata.EntityFilters.Relationships=8;SDK.Metadata.EntityFilters.All=15;SDK.Metadata.EntityFilters.__enum=!0;SDK.Metadata.EntityFilters.__flags=!0;